# ExportLineweightInfo Class

---
A value used to represent the info stored in the ExportLineweightTable.
SystemObject Autodesk.Revit.DBExportLineweightInfo
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ExportLineweightInfo : IDisposable

    Public Class ExportLineweightInfo
    	Implements IDisposable

    public ref class ExportLineweightInfo : IDisposable

    type ExportLineweightInfo =
        class
            interface IDisposable
        end
The ExportLineweightInfo type exposes the following members.
| Name| Description
---|---|---
| ExportLineweightInfo|  Constructs a new default ExportLineweightInfo.
| ExportLineweightInfo(ExportLineweightInfo)|  Constructs a new copy of the input ExportLineweightInfo object.
| ExportLineweightInfo(String)|  Constructs a new ExportLineweightInfo using the destination line weight name as input.
Top
| Name| Description
---|---|---
| DestinationLineweightName|  The destination lineweight name (the name of the line weight in the exported format)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ExportLineweightInfo
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace